{"name": "Abdul Rafay", "email": "abdulrafay1747@gmail.com", "phone": "+92 3115781747", "headline": "Computer Science Student", "location": "Rawalpindi, Pakistan", "summary": "Student of computer science with a strong foundation in programming, algorithms and software development. Passionate about machine learning, deep learning and generative AI. Proficient in Python, TensorFlow, PyTorch, Scikit-Learn, and experienced in data preprocessing, model training, and evaluation with hands-on experience in building predictive models and working with real-world datasets.", "skills": ["Python", "Tensorflow", "Scikit-learn", "Numpy", "Pandas", "Flask", "MLFlow", "DVC", "Prometheus", "Grafana", "C", "C++", "ASP.NET", "Kotlin", "Flutter", "HTML", "CSS", "JavaScript", "MongoDB", "SQL Server", "Cloud Platforms", "Google Cloud", "AWS", "ModelBit", "Firebase", "Railway"], "work_experience": [], "education": [{"school": "FAST NUCES Islamabad", "degree": "BSc Computer Science", "start": "2021", "end": "2025", "description": "Relevant Courses: Deep learning, Statistical Modeling, Artificial Intelligence, Parallel and Distributed Computing, Cloud Computing, Programming Fundamentals, OOP, Data Structures, Database Systems, Algorithms, Computer Networks."}], "projects": [{"title": "Video Frame Prediction using Deep Learning", "link": null, "description": "Developed a video prediction model that generates future frames from short input sequences using the UCF101 dataset. Implemented and compared three deep learning models: ConvLSTM, PredRNN, and a Transformer-based model to capture spatial-temporal patterns in videos."}, {"title": "MLOps Environmental Monitoring and Pollution Prediction System", "link": null, "description": "Developed an MLOps pipeline to monitor environmental data (air quality, weather, and pollution levels) and predict pollution trends. Implemented DVC for versioning real-time environmental data collected from OpenWeatherMap and AirVisual APIs."}, {"title": "Plant Species Classification using Deep Learning", "link": null, "description": "Developed a deep learning model using CNN to classify plant species based on leaf images. Collected and preprocessed a dataset of leaf images, including resizing, augmentation, and normalization."}], "certifications": [], "languages": ["Urdu", "English"], "links": ["https://in/Abdul Rafay", "https://github.com/rafay-47", "https://www.linkedin.com/in/abdul-rafay-sheikh-40273a298/", "https://www.nu.edu.pk/"], "extracted_keywords": ["Machine Learning", "Deep Learning", "Generative AI", "Python", "TensorFlow", "PyTorch", "Scikit-Learn", "Data Preprocessing", "Model Training", "Evaluation", "Predictive Models", "Real-world Datasets"]}